[
  {
    "version": 146,
    "date": "19.7.2025",
    "changes": [
      "<b>Opravy chyb:</b>",
      "Změna spouštění služby pro sledování času HDO, která zobrazuje aktuální sazbu v notifikaci.",
      "Od verze Android 12 již není možné automaticky spouštět službu na pozadí (např. po restartu zařízení). Nyní se zobrazí notifikace pro její ruční spuštění."
    ]
  },
  {
    "version": 145,
    "date": "4.7.2025",
    "changes": [
      "<b>Opravy chyb:</b>",
      "Načítání HDO času z distribuční sítě EG.D. "
    ]
  },
  {
    "version": 144,
    "date": "26.3.2025",
    "changes": [
      "<b>Opravy chyb:</b>",
      "Pád aplikace při operacích v měsíčních odečtech."
    ]
  },
  {
    "version": 143,
    "date": "12.3.2025",
    "changes": [
      "<b>Opravy chyb:</b>",
      "Chybné zobrazení menu při spuštění aplikace z notifikace.",
      "Chybné zobrazení jednotkových cen v seznamu ceníků na malé obrazovce.",
      "Chybné sčítání v detailu faktury, pokud byl počet položek větší než velikost obrazovky.",
      "Pád aplikace při načítání seznamu záložních souborů."
    ]
  },
  {
    "version": 142,
    "date": "15.12.2024",
    "changes": [
      "<b>Nová data:</b><br>Doplněny regulované ceny pro rok 2025."
    ]
  },
  {
    "version": 141,
    "date": "30.11.2024",
    "changes": [
      "<b>Nová funkce:</b><br>Zavedení nové položky v regulované části ceníku: <b>\"Provoz nesíťové infrastruktury\"</b>",
      "<b>Nová funkce:</b><br>Automatická úprava ceníků platných v roce 2024. U stávajících ceníků je zkrácena platnost do 30.6.2024. Současně je vytvořen nový ceník s platností od 1.7.2024 a je přiřazen k měsíčním odečtům zapsaných po 1.7.2024.",
      "<b>Nová funkce:</b><br>Zavedení informační části \"O aplikaci\".",
      "<b>Oprava chyby:</b><br>Pád aplikace při vkládání měsíčního odečtu, pokud datum zálohové platby nebylo uvedeno v očekávaném formátu."
    ]
  },
  {
    "version": 140,
    "date": "22.8.2024",
    "changes": [
      "<b>Oprava chyby:</b><br>Náhodný pád aplikace při mazání měsíčních odečtů."
    ]
  },
  {
    "version": 139,
    "date": "11.7.2024",
    "changes": [
      "<b>Oprava chyby:</b><br>Pád aplikace při importu ceníků, pokud nebylo uděleno oprávnění zápisu do složky.",
      "<b>Oprava chyby:</b><br>Pád aplikace při výběru sazeb ceníků při importu ceníků."
    ]
  },
  {
    "version": 136,
    "date": "21.6.2024",
    "changes": [
      "<b>Oprava chyby:</b><br>Nefunkční načítání HDO tarifů u EGD."
    ]
  }
]